# 미션 2 (2일차)
- 아래의 미션을 Jupyter Notebook으로 푼 후 [File] - [Download as] - [HTML] 저장 제출
- birdland1903@gmail.com
- 제출양식 : Day2_Mission_홍길동
- 처음 풀이 시, 30분 정도 구글링이나 Chat GPT 없이 풀이

## 1. 5의 배수로 구성된 9개의 값을 생성한 후, Numpy Matrix 3x3 행렬로 만든 후, 첫번째 행의 합과 평균을 구하는 함수를 생성

|  |  |  |
|--|--|--|
|5 |10|15|
|20|25|30|
|35|40|45|

In [2]:
import numpy as np

def cal_mat(m):
    sum=0
    for i in range(len(m[0])):
        sum+=m[0][i]
    # print(sum)

    mean = sum/len(m[0])
    # print(mean)
    print(f"첫 번째 행의 합은 {sum}, 평균은 {mean}입니다.")


mat = np.array([x for x in range(1,46) if x%5==0])
mat = mat.reshape(3,3)

cal_mat(mat)

첫 번째 행의 합은 30, 평균은 10.0입니다.

In [6]:
# 선생님
def func1():
    mat = np.array([x for x in range(1,46) if x%5==0])
    mat = mat.reshape(3,3)
    sum = mat[0].sum()
    mean = mat[0].mean()
    print(f"첫 번째 행의 합은 {sum}, 평균은 {mean}입니다.")

func1()

첫 번째 행의 합은 30, 평균은 10.0입니다.

## 2. 두 개의 값을 입력받아 두 값 사이의 10개의 데이터를 일정 간격으로 생성해, Vector형태로 출력하는 함수를 생성

In [3]:
def get_vector():
    a,b = map(int,input().split())
    if a==b:
        print("다시입력하세요")
        a,b = map(int,input().split())
        
    data = np.linspace(a,b,10)
    return [round(x,3) for x in data]

l = get_vector()
l

 1 11

[1.0, 2.111, 3.222, 4.333, 5.444, 6.556, 7.667, 8.778, 9.889, 11.0]

## 3. 학생의 이름과 국어점수, 영어점수, 수학점수를 입력받아 Pandas의 DataFrame형태로 구성하는 함수를 생성

In [8]:
import pandas as pd

def get_df():
    name = input('이름 : ')
    sc1 = input('국어점수 : ')
    sc2 = input('영어점수 : ')
    sc3 = input('수학점수 : ')
    # 키 -> 컬럼명, 벨류 -> 컬럼의 값
    
    l_n = []
    l_sc1 = []
    l_sc2 = []
    l_sc3 = []

    l_n.append(name)
    l_sc1.append(sc1)
    l_sc2.append(sc2)
    l_sc3.append(sc3)
    
    dict_sc = {'name':l_n,'국어점수':l_sc1,'영어점수':l_sc2,'수학점수':l_sc3}
    return dict_sc
    
dict_sc = get_df()
d=pd.DataFrame(dict_sc)
d

이름 :  rla
국어점수 :  01
영어점수 :  20
수학점수 :  304

  name 국어점수 영어점수 수학점수
0  rla   01   20  304

In [33]:
import pandas as pd
l_n = []
l_sc1 = []
l_sc2 = []
l_sc3 = []

def get_df():
    data = list(input().split()) #[1,2,3,4]
    
    l_n.append(data[0])
    l_sc1.append(data[1])
    l_sc2.append(data[2])
    l_sc3.append(data[3])
    
    dict_sc = {'name':l_n,'국어점수':l_sc1,'영어점수':l_sc2,'수학점수':l_sc3}
    
    return dict_sc

count = int(input('횟수를 입력하세요'))
for x in range(count):
    dict_sc = get_df()
d=pd.DataFrame(dict_sc)
d

횟수를 입력하세요 3
 1 2 3 4
 1 2 3 4
 1 2 3 4

  name 국어점수 영어점수 수학점수
0    1    2    3    4
1    1    2    3    4
2    1    2    3    4

In [7]:
lst = list(input().split())
df1 = pd.DataFrame(data =[lst], columns = ['이름','국어','영어','수학'])
df1

 1 1 1 1

  이름 국어 영어 수학
0  1  1  1  1

# 01_Data.csv 파일을 가져와 df1으로 선언하고, 아래의 미션을 수행

In [10]:
df1 = pd.read_csv('01_Data.csv')
df1

,Index,Member_ID,Sales_Type,Contract_Type,Channel,Datetime,Term,Payment_Type,Product_Type,Amount_Month,Customer_Type,Age,Address1,Address2,State,Overdue_count,Overdue_Type,Gender,Credit_Rank,Bank
0,1,66758234,렌탈,일반계약,영업방판,2022-05-05,60,CMS,DES-1,96900,개인,42.0,경기도,경기도,계약확정,0,없음,여자,9.0,새마을금고
1,2,66755948,렌탈,교체계약,영업방판,2023-02-19,60,카드이체,DES-1,102900,개인,39.0,경기도,경기도,계약확정,0,없음,남자,2.0,현대카드
2,3,66756657,렌탈,일반계약,홈쇼핑/방송,2022-02-27,60,CMS,DES-1,96900,개인,48.0,경기도,경기도,계약확정,0,없음,여자,8.0,우리은행
3,4,66423450,멤버십,멤버십3유형,재계약,2022-05-12,12,CMS,DES-1,66900,개인,39.0,경기도,경기도,계약확정,0,없음,남자,5.0,농협회원조합
4,5,66423204,멤버십,멤버십3유형,재계약,2022-05-09,12,CMS,DES-1,66900,개인,60.0,경기도,경기도,기간만료,12,있음,남자,8.0,농협회원조합
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
51296,51298,66579515,렌탈,프로모션계약,대형마트A,2022-02-28,60,CMS,DES-3A,96900,개인,47.0,경기도,경기도,계약확정,0,없음,남자,NaN,기업은행
51297,51299,66799558,렌탈,일반계약,대형마트A,2022-03-31,60,CMS,DES-1,96900,개인,42.0,경기도,경기도,계약확정,0,없음,여자,8.0,새마을금고
51298,51300,66799197,렌탈,프로모션계약,영업방판,2022-03-31,39,카드이체,ERA,120900,개인,65.0,서울특별시,서울특별시,계약확정,0,없음,여자,1.0,롯데카드
51299,51301,66792778,렌탈,일반계약,홈쇼핑/방송,2023-02-05,60,카드이체,DES-1,96900,개인,54.0,서울특별시,서울특별시,계약확정,0,없음,여자,2.0,롯데카드
51300,51302,66799607,렌탈,일반계약,홈쇼핑/방송,2022-04-23,60,CMS,DES-1,96900,개인,53.0,서울특별시,서울특별시,계약확정,0,없음,여자,8.0,신한은행

## 4. 해당 데이터에서 고객의 계약명단 중 우수 고객을 찾고자 한다. df1 데이터에서 월랜탈비용(Amount_Month)가 높고, 연령이 낮은(Age) 상위 50명의 고객 계약명단을 추출해 result3.xlsx저장

In [60]:
df2 = df1.sort_values(by=['Amount_Month','Age'],
               ascending=[0,1])
df2.head(50).to_excel('result3.xlsx')

In [11]:
df2 = df1.sort_values(by=['Amount_Month','Age'],
               ascending=[0,1]).head(50).to_excel('result3.xlsx')

## 5.젊은 고객들을 대상으로 마케팅 전략을 수립하기 위해. 연령이 낮은 100명의 계약 명단을 추출하여, df1_young 변수로 선언하고 데이터의 구조와 타입을 확인

In [12]:
df1_young = df1.sort_values(by='Age',ascending=1).head(100)
df1_young.info()
# 데이터 타입 : float64, 구조: 18개의 컬럼 존재
#  18  Credit_Rank    88 non-null     float64 에 결측치가 있다

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 46706 to 5846
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          100 non-null    int64
 1   Member_ID      100 non-null    int64
 2   Sales_Type     100 non-null    object
 3   Contract_Type  100 non-null    object
 4   Channel        100 non-null    object
 5   Datetime       100 non-null    object
 6   Term           100 non-null    int64
 7   Payment_Type   100 non-null    object
 8   Product_Type   100 non-null    object
 9   Amount_Month   100 non-null    int64
 10  Customer_Type  100 non-null    object
 11  Age            100 non-null    float64
 12  Address1       100 non-null    object
 13  Address2       100 non-null    object
 14  State          100 non-null    object
 15  Overdue_count  100 non-null    int64
 16  Overdue_Type   100 non-null    object
 17  Gender         100 non-null    object
 18  Credit_Rank    88 non-null     float64
 19  Bank           100 non-null    object
dtypes: float64(2), int64(5), object(13)
memory usage: 16.4+ KB

In [14]:
# 결측치 확인
df1.isnull().sum()

Index               0
Member_ID           0
Sales_Type          0
Contract_Type       0
Channel             0
Datetime            0
Term                0
Payment_Type        0
Product_Type        0
Amount_Month        0
Customer_Type       2
Age              6972
Address1            2
Address2            2
State               0
Overdue_count       0
Overdue_Type        0
Gender              0
Credit_Rank      8781
Bank             2759
dtype: int64

In [18]:
# 결측치 제거
p1 = df1.dropna()
p1
(p1.isnull().sum().values).sum()

0

## 6. df1_young 데이터와 df1 데이터의 월랜탈비용(Amount_Month)의 평균을 계산하고, 두 값의 차이를 계산

In [102]:
dy = df1_young['Amount_Month'].values
d = df1['Amount_Month'].values
dy_m = np.sum(d_y)/100
d = np.sum(d)/len(d)

print(f"df1_young 데이터의 월랜탈비용 평균은 {dy_m}이고, df1 데이터의 평균은 {d}입니다.")
print(f"두 값의 차이는 {round(abs(dy_m-d),2)}입니다.")

df1_young 데이터의 월랜탈비용 평균은 94191.0이고, df1 데이터의 평균은 93994.97428900021입니다.
두 값의 차이는 196.03입니다.

In [20]:
abs(df1_young['Amount_Month'].mean())

94191.0

## 7. df1_young에서 월랜탈비용이 높고 연체건수(Overdue_Count)가 낮은 순서대로 정렬해, result_young.xlsx로 저장하시오.

In [22]:
d_ao = df1.sort_values(by=['Amount_Month','Overdue_count'],
               ascending=[0,1])[['Amount_Month','Overdue_count']] # 2개 항목만 볼 수 있따.
d_ao
# d_ao.to_excel('result_young.xlsx')

       Amount_Month  Overdue_count
19412        215700              0
19413        215700              0
19773        215700              0
19774        215700              0
28147        215700              0
...             ...            ...
51277         54603              0
51280         54603              0
51284         54603              0
51290         54603              0
42145         54603              1

[51301 rows x 2 columns]

## 8. 본사에서 매출관리를 위해 연체가 높은 고객들을 확인하여 관리하고자 한다. 연체건수가 높은 순서대로 정렬하고, 상위 100명의 고객의 연령(Age)의 최대값과 최소값을 확인, 신용등급(Credit_Rank)의 평균을 계산

In [124]:
do = df1.sort_values(by='Overdue_count',ascending=0).head(100)
do_c = do['Credit_Rank'].values
do_c = np.nan_to_num(do_c) # 결측치 0으로 처리

do_c_mean = np.sum(do_c)/len(do_c)

do_a_max = do['Age'].max()
do_a_min = do['Age'].min()

print(f"가장 많은 나이 : {do_a_max}, 가장 적은 나이 : {do_a_min}, 신용등급의 평균 : {do_c_mean}")

가장 많은 나이 : 85.0, 가장 적은 나이 : 26.0, 신용등급의 평균 : 5.07

In [23]:
do = df1.sort_values(by='Overdue_count',ascending=0).head(100)
do_a_max = do['Age'].max()
do_a_min = do['Age'].min()

# 평균
do['Credit_Rank'].mean() # 벨류가져와서 넘파이 연산할 필요 없음 이미 연산 지원해줌 시리즈 형태니까 넘파이 형태임

6.945205479452055

## 9. 매출관리 부서 A씨는 매주 해당 데이터를 받아 계약금액이 높은 1000개의 계약명단의 평균값을 계산하고 있다. 이 업무를 자동화 하기 위해, 월랜탈비용이 높은 1000갸의 데이터를 추출하여, 해당 데이터의 월랜탈비용의 평균을 계산하는 함수를 만드시오.

In [25]:
def get_mean():
    
    data = input('csv파일 이름 입력하세요')
    df = pd.read_csv(data)
    
    df_acc = df.sort_values(by='Amount_Month',ascending=0).head(1000)
    # acc_val = do['Amount_Month'].values
    # acc_mean = np.sum(acc_val)/len(acc_val) # 이거 결과값이 다름 뭔가 이상함
    acc_mean = df_acc['Amount_Month'].mean()
    
    return acc_mean
    
mean = get_mean()
print(mean)

csv파일 이름 입력하세요 01_Data.csv

104109.0